Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This allows you to use different dev service environments depending on the Quarkus config profiles. You can also specify multiple files by separating them with commas:
ja_jp: これにより、Quarkus の設定プロファイルに応じて異なる dev service 環境を使用できます。複数のファイルをカンマで区切って指定することも可能です:

source: This allows your custom `ExceptionMapper` for `JsonMappingException` to handle all its subclasses, including `MismatchedInputException`.
ja_jp: これにより、`JsonMappingException` のカスタム `ExceptionMapper` が、`MismatchedInputException` を含むすべてのサブクラスを処理できるようになります。

source: This allows your reactive methods to keep on working on the transaction asynchronously until their work is really done, and not just until the reactive method returns.
ja_jp: これにより、リアクティブメソッドは、リアクティブメソッドが戻るまでではなく、その処理が本当に終了するまで、非同期でトランザクションを処理し続けることができます。

source: This alpha release brings us significantly closer to a stable 1.0 SDK. Our focus areas for upcoming releases include:
ja_jp: このアルファ版リリースにより、安定版の 1.0 SDK に大きく近づきました。今後のリリースにおける主要な焦点は以下のとおりです。

source: This also applies to the CDI request context: if it is active on the original thread, it is propagated to the new thread, but if it's not, then the new thread won't have it either. This is contrary to MicroProfile Fault Tolerance specification, which states that the request context must be active during the `@Asynchronous` method invocation.
ja_jp: これは CDI リクエストコンテキストにも当てはまります。もしオリジナルのスレッドでアクティブであれば、新しいスレッドに伝搬されますが、もしそうでなければ、新しいスレッドはそれを持ちません。 これは MicroProfile Fault Tolerance 仕様に反しており、 `@Asynchronous` メソッド呼び出しの間はリクエストコンテキストがアクティブでなければならないとされています。

source: This also means that the runtime version can be linked against a different set of dependencies, e.g. the hibernate version used at deployment time might want to include ByteBuddy, while the version used at runtime does not.
ja_jp: これは、実行時のバージョンは別の依存関係のセットに対してリンクされる可能性があることを意味します。例えば、デプロイ時に使用する Hibernate バージョンには ByteBuddy が含まれていても、実行時に使用するバージョンには含まれていない場合があります。

source: This also means that you can xref:qute-reference.adoc#user_tags[add custom Qute tags] in `/dev-templates/tags` for your templates to use.
ja_jp: これにより、 `/dev-templates/tags` にテンプレートが使用する link:qute-reference.html#user_tags[カスタムQuteタグを追加]することもできます。

source: This annotation affects only business method interceptors (`@AroundInvoke`) and constructor lifecycle callback interceptors (`@AroundConstruct`).
ja_jp: このアノテーションは、ビジネスメソッドインターセプター (`@AroundInvoke`) とコンストラクターライフサイクルコールバックインターセプター (`@AroundConstruct`) にのみ影響します。

source: This annotation allows you to directly inject the URL of the Quarkus instance, the value of the annotation will be the path component of the URL
ja_jp: このアノテーションを使用すると、QuarkusインスタンスのURLを直接注入することができます。アノテーションの値は、URLのパス部分になります。

source: This annotation can be used to configure some defaults for reactive routes declared on a class.
ja_jp: このアノテーションを使用して、クラスで宣言されたReactive Routesのデフォルトを設定できます。

source: This annotation can be used when you want to project `@Embedded` entity or `@ManyToOne`, `@OneToOne` relation. It does not support `@OneToMany` or `@ManyToMany` relation.
ja_jp: このアノテーションは、 `@Embedded` エンティティまたは `@ManyToOne` , `@OneToOne` リレーションを投影する場合に使用できます。 `@OneToMany` または `@ManyToMany` 関係には対応していません。

source: This annotation can only be used in conjunction with endpoints annotated with link:{blockingannotation}[@Blocking] or considered blocking because of their signature. You can visit xref:resteasy-reactive.adoc#execution-model-blocking-non-blocking[Execution model, blocking, non-blocking] for more information.
ja_jp: このアノテーションは link:{blockingannotation}[@Blocking] アノテーションが付けられたエンドポイント、またはそのシグネチャのためにブロッキングとみなされるエンドポイントとの組み合わせでのみ使用することができます。詳しくは xref:resteasy-reactive.adoc#実行モデルブロッキングノンブロッキング[実行モデル、ブロッキング、ノンブロッキング] をご確認ください。

source: This annotation cannot be used on a method returning `void`.
ja_jp: このアノテーションは、 `void` を返すメソッドでは使用できません。

source: This annotation defines your transaction boundaries and will wrap this call within a transaction.
ja_jp: このアノテーションは、トランザクションの境界を定義し、トランザクション内でこの呼び出しをラップします。

source: This annotation is not necessary when the path part matches the method parameter name
ja_jp: パス部分がメソッドパラメータ名と一致する場合は、このアノテーションは必要ありません

source: This annotation is optional and should only be used when some method arguments are NOT part of the cache key.
ja_jp: このアノテーションはオプションで、メソッドの引数の一部がキャッシュキーの一部ではない場合にのみ使用されるべきです。

source: This annotation is optional and should only be used when some of the method arguments are NOT part of the cache key.
ja_jp: このアノテーションはオプションで、メソッドの引数の一部がキャッシュキーの一部ではない場合にのみ使用されるべきです。

source: This annotation is our response to a recurring request from the community: having the ability to rollback changes made in a test.
ja_jp: このアノテーションは、コミュニティからの繰り返し要望のあった、テストで行われた変更をロールバックする機能への対応です。

source: This annotation may only be placed on the top level method delineating the transaction. Annotated nested methods once a transaction has started will throw an exception.
ja_jp: このアノテーションは、トランザクションを定義するトップレベルのメソッドにのみ付けることができます。アノテーションされたネストされたメソッドでトランザクションが開始されると、例外がスローされます。

source: This annotation must be present on a single entity. It can be a regular Hibernate ORM entity or a Hibernate ORM with Panache entity as in this example.
ja_jp: このアノテーションは、単一のエンティティーに存在しなければなりません。この例のように、通常のHibernate ORMエンティティーまたはHibernate ORM with Panacheエンティティーにすることができます。

source: This annotation tells Quarkus to use this as the main method, unless it is overridden in the config
ja_jp: このアノテーションは、設定でオーバーライドされない限り、これをメインのメソッドとして使用するようQuarkusに指示します。

source: This annotation will register the cache implementation classes for reflection and this will include the classes into the native executable.
ja_jp: このアノテーションは、リフレクション向けにキャッシュ実装クラスを登録し、そのクラスをネイティブ実行可能ファイルに含めます。

source: This annotation will register the cache implementation classes for reflection and this will include the classes into the native executable. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: このアノテーションによって、キャッシュ実装クラスがリフレクション用に登録され、そのクラスがネイティブ実行可能ファイルに組み込まれます。 `@RegisterForReflection` アノテーションの詳細は、 xref:writing-native-applications-tips.adoc#registerForReflection[ネイティブ・アプリケーションのヒント] のページを参照してください。

source: This announcement contains a lot of information about the new features and how to upgrade so we recommend reading it thoroughly before upgrading to Quarkus 3.
ja_jp: このアナウンスには、新機能やアップグレード方法に関する多くの情報が含まれていますので、Quarkus 3にアップグレードする前に、このアナウンスを十分に読むことをお勧めします。

source: This application can be packaged using:
ja_jp: このアプリケーションは、以下の方法でパッケージングすることができます。

source: This application goal is to infer potential issues with the status of a home automation setup, so we create the necessary domain models to represent status of sensors, devices and other things inside the house.
ja_jp: このアプリケーションの目標は、ホームオートメーション設定の状態に関して発生する可能性のある問題を推測することであるため、家の中のセンサー、デバイス、その他のものの状態を表すために必要なドメインモデルを作成します。

source: This application has almost no magic, just a single annotation, and a regular Java entry point. You may wonder why not using a bare Java program? Even used that way, Quarkus provides benefits. For example, you can access the built-in configuration support as illustrated in the snippet:
ja_jp: このアプリケーションにはマジックはほとんどなく、ただのアノテーション1つと、普通のJavaのエントリーポイントがあるだけです。なぜむき出しのJavaプログラムを使わないのかと疑問に思うかもしれません。そのように使用しても、Quarkusには利点があります。例えば、スニペットに示されているように、組み込みの設定サポートにアクセスすることができます:

source: This application https://github.com/cescoffier/quarkus-magic-control/blob/main/no-magic-example/pom.xml#L17-L26[depends] directly on Vert.x Web and Vert.x Core. The only Quarkus dependency is Arc (not used directly but required):
ja_jp: このアプリケーションは Vert.x Web と Vert.x Core に直接 link:https://github.com/cescoffier/quarkus-magic-control/blob/main/no-magic-example/pom.xml#L17-L26[依存します]。Quarkusの依存関係はArcだけです(直接は使用しませんが必須です):

source: This approach allows bi-directional streaming.
ja_jp: このアプローチにより、双方向のストリーミングが可能になります。

source: This approach covers most of the configuration cases. However, non-serializable objects such as `CryptoKeyReader`, `ServiceUrlProvider` etc. cannot be configured this way. The Pulsar Connector allows taking into account instances of Pulsar configuration data objects – `ClientConfigurationData`, `ConsumerConfigurationData`, `ProducerConfigurationData`:
ja_jp: この方法は、ほとんどの設定ケースに対応できます。 ただし、 `CryptoKeyReader`、 `ServiceUrlProvider` などのシリアライズできないオブジェクトは、この方法では設定できません。 Pulsar コネクターを使用すると、Pulsar 設定データオブジェクト `ClientConfigurationData`、 `ConsumerConfigurationData`、 `ProducerConfigurationData` のインスタンスを考慮できます。

source: This approach enables a gradual migration where:
ja_jp: このアプローチにより、次のような段階的な移行が可能になります。

source: This approach gives you a simpler API sequence:
ja_jp: このアプローチにより、よりシンプルな API シーケンスが実現します。

source: This approach has an unfortunate side effect: as we said before, Quarkus can also cache `null` values. Which means that the next call to `callRemote()` with the same parameter value will be answered out of the cache, returning `null` and no remote call will be done. This may be desired in some scenarios, but usually one wants to retry the remote call until it returns a result.
ja_jp: このアプローチには不幸な副作用があります。先に述べたように、Quarkusは `null` の値をキャッシュすることもできます。つまり、同じパラメーター値を持つ `callRemote()` への次の呼び出しは、キャッシュの外で応答され、 `null` が返され、リモートコールは行われないということです。これはシナリオによっては望ましいことかもしれませんが、通常は結果が返ってくるまでリモートコールを再試行したいものです。

source: This approach is recommended for configuring Jackson settings.
ja_jp: Jackson 設定を設定する場合は、このアプローチが推奨されます。

source: This approach is reflected in the manifests generated by xref:deploying-to-kubernetes.adoc#kubernetes[Kubernetes extension].
ja_jp: このアプローチは、 xref:deploying-to-kubernetes.adoc#kubernetes[Kubernetesエクステンション] によって生成されるマニフェストに反映されています。

source: This approach offers several benefits:
ja_jp: このアプローチにはいくつかの利点があります。

source: This approach only works for JVM tests. It cannot be used for native tests (because they do not support injection).
ja_jp: このアプローチは、JVM テストでのみ機能します。インジェクションには対応していないため、ネイティブテストには使用できません。

source: This approach provides a more limited coverage compared to the Wiremock approach - for example, the remote communication code is not covered.
ja_jp: このアプローチは、Wiremockのアプローチと比較して、より限定された範囲をカバーします。例えば、リモート通信コードはカバーされません。

source: This approach provides limited coverage compared to the WireMock approach. For example, the remote communication code is not covered.
ja_jp: この方法では、WireMock 方法と比較してカバレッジが制限されます。 たとえば、リモート通信コードはカバーされません。

source: This approach requires a working container runtime (Docker or xref:podman.adoc[Podman]).
ja_jp: この方法では、動作するコンテナランタイム（Dockerまたは link:podman.html[Podman] ）が必要です。

source: This architecture allows operators to deploy Polaris with the persistence layer that matches their infrastructure requirements, simply by changing the `polaris.persistence.nosql.backend` configuration property.
ja_jp: このアーキテクチャにより、オペレーターは `polaris.persistence.nosql.backend` 設定プロパティーを変更するだけで、インフラストラクチャ要件に合致する永続化層で Polaris をデプロイできます。

source: This article covers the runtime and deployment content only as the other things are optional, generated by the project template already or even important, but not the most important and pragmatic thing when you want to learn how a Quarkus extension can be created. Let’s start with the deployment section. It contains classes needed for the initialization of the Quarkus extension. Without this initialization class, your extension won’t be identified when starting your Quarkus application.
ja_jp: この記事では、runtimeとdeploymentの中身のみを取り上げます。その他の中身は、オプションであったり、すでにプロジェクトテンプレートによって生成されていたり、あるいは重要であっても、Quarkusのエクステンションがどのように作成されるかを知りたい場合には、最も重要で実用的なものではありません。まず、導入セクションから始めましょう。ここには、Quarkusエクステンションの初期化に必要なクラスが含まれています。この初期化クラスがないと、Quarkusアプリケーションの起動時にエクステンションが識別されません。

source: This article introduces the https://github.com/quarkusio/quarkus-super-heroes[Quarkus Superheroes sample application^], discusses some of the requirements for building it, and illustrates how to run it locally or deploy it to https://kubernetes.io[Kubernetes^]. You can also watch the https://youtu.be/7M0Tvlx-GTA[Quarkus Insights episode^] where it was introduced.
ja_jp: この記事では、 link:https://github.com/quarkusio/quarkus-super-heroes[Quarkus Superheroesのサンプルアプリケーション, window=_blank]を紹介し、構築するための要件を説明し、ローカルで実行する方法や link:https://kubernetes.io[Kubernetes, window=_blank]にデプロイする方法を説明します。また、このサンプルアプリケーションが紹介された link:https://youtu.be/7M0Tvlx-GTA[Quarkus Insightsのエピソード, window=_blank]もご覧いただけます。

source: This artifact provides the `io.quarkus.test.security.TestSecurity` annotation, that can be applied to test methods and test classes to control the security context that the test is run with. This allows you to do two things, you can disable authorization so tests can access secured endpoints without needing to be authenticated, and you can specify the identity that you want the tests to run under.
ja_jp: このアーティファクトは `io.quarkus.test.security.TestSecurity` アノテーションを提供します。これをテストメソッドやテストクラスに適用することで、テストが実行されるセキュリティーコンテキストを制御することができます。認証を必要とせずに安全なエンドポイントにテストがアクセスできるように認証を無効にすることができ、テストを実行する際の ID を指定することができます。

source: This assumes that the key file is included to the application classpath as a resource, then the configuration would like the following:
ja_jp: これは、キーファイルがリソースとしてアプリケーションクラスパスに含まれていることを前提としています。この場合、設定は次のようになります。

source: This auto-attachment can be disabled using:
ja_jp: この自動アタッチは、以下を使用して無効にできます。

source: This automatic resolution is applicable in most cases so that driver configuration is not needed.
ja_jp: この自動解決はほとんどの場合に適用可能であり、ドライバーの設定は必要ありません。

source: This bean receives the name and returns the greeting message.
ja_jp: このBeanは、名前を受け取り、グリーティングメッセージを返します。

source: This bean receives the name, and returns the greeting message.
ja_jp: この Bean は name を受け取り、 greeting メッセージを返します.

source: This bean would be assignable to `@Inject @Superior Translator` and `@Inject @Superior SuperiorTranslator` but not to `@Inject Translator`. The reason is that `@Inject Translator` is automatically transformed to `@Inject @Default Translator` during typesafe resolution. And since our `SuperiorTranslator` does not declare `@Default` only the original `Translator` bean is assignable.
ja_jp: このBeanは `@Inject @Superior Translator` と `@Inject @Superior SuperiorTranslator` には割り当てられますが、 `@Inject Translator` には割り当てられません。その理由は、 `@Inject Translator` はタイプセーフ解決の際に自動的に `@Inject @Default Translator` に変換されるからです。また、私たちの `SuperiorTranslator` は `@Default` を宣言していないので、元の `Translator` Beanだけが代入可能です。

source: This behavior can be changed by giving the `debug` system property one of the following values:
ja_jp: この動作は、 `debug` システム・プロパティーに以下の値のいずれかを与えることで変更できます。

source: This behavior can be disabled by setting the `quarkus.elasticsearch.health.enabled` property to `false` in your `application.properties`.
ja_jp: この動作は、 `application.properties` の `quarkus.elasticsearch.health.enabled` プロパティーを `false` に設定することで無効にできます。

source: This behavior can be disabled by setting the `quarkus.mongodb.health.enabled` property to `false` in your `application.properties`.
ja_jp: この動作は、 `application.properties` で `quarkus.mongodb.health.enabled` プロパティーを `false` に設定することで無効にできます。

source: This behavior can be disabled by setting the `quarkus.redis.health.enabled` property to `false` in your `application.properties`.
ja_jp: この動作は、 `application.properties` の `quarkus.redis.health.enabled` プロパティーを `false` に設定することで無効にできます。

source: This behavior can be disabled by using the `quarkus.datasource.health.enabled` property.
ja_jp: この動作を無効にするには、 `quarkus.datasource.health.enabled` プロパティを使用します。

source: This behavior can be disabled via the property `quarkus.datasource.health.enabled`.
ja_jp: この動作は、プロパティー `quarkus.datasource.health.enabled` で無効にすることができます。

source: This behavior can be disabled via the property `quarkus.infinispan-client.health.enabled`.
ja_jp: この動作は、プロパティ `quarkus.infinispan-client.health.enabled` で無効にすることができます。

source: This behavior is consistent with Elasticsearch's https://www.elastic.co/guide/en/elasticsearch/reference/current/near-real-time.html[near-real-time search] and the recommended way of using Hibernate Search even when coordination is disabled.
ja_jp: この動作は、Elasticsearchの link:https://www.elastic.co/guide/en/elasticsearch/reference/current/near-real-time.html[Near real-time search]と一致しており、連携が無効な場合でもHibernate Searchを使用する場合は推奨されています。

source: This behavior is new to GraalVM 21.3+.
ja_jp: この動作は、GraalVM 21.3+の新機能です。

source: This behaviour can be changed by disabling the validation.
ja_jp: この動作は、バリデーションを無効にすることで変更できます。

source: This being said, you still need to specify the version of the Kotlin compiler to use. Again, it is recommended to use the same version which Quarkus uses for the Kotlin libraries.
ja_jp: そうは言っても、使用する Kotlin コンパイラのバージョンを指定する必要があります。 繰り返しになりますが、Quarkus が Kotlin ライブラリに使用するのと同じバージョンを使用することをお勧めします。

source: This binder keeps track of the number of pinning events and the number of virtual threads failed to be started or un-parked. See the https://docs.micrometer.io/micrometer/reference/reference/jvm.html#_java_21_metrics[MicroMeter documentation] for more information.
ja_jp: このバインダーは、ピニングイベントの数と、開始またはパーク解除に失敗した仮想スレッドの数を追跡します。 詳細は、 https://docs.micrometer.io/micrometer/reference/reference/jvm.html#_java_21_metrics[MicroMeter ドキュメント] を参照してください。

source: This bit is a bit awkward, unfortunately! In Quarkus 3.28, a new `devservices` runtime module was introduced. Most extensions have both a deployment and a runtime module, but historically, Dev Services only had a deployment module. The associated runtime classes lived in other modules. A runtime module was added in 3.28. Because it was a potentially disruptive change, it was done post-LTS. That seemed like a good idea, but it had some unexpected consequences. The introduction of the new module was done in a way which preserved backwards compatibility, but not forward compatibility. That means extensions built against 3.27 will work with the 3.27 LTS, but not 3.28 or later versions. Extensions built with 3.28 will work with 3.27, and also 3.28 and later versions.
ja_jp: この部分は残念ながら少し厄介です。 Quarkus 3.28 では、新しい `devservices` ランタイムモジュールが導入されました。ほとんどのエクステンションにはデプロイメントモジュールとランタイムモジュールの両方がありますが、歴史的に Dev Services にはデプロイメントモジュールしかありませんでした。関連するランタイムクラスは他のモジュールに存在していました。ランタイムモジュールは 3.28 で追加されました。破壊的な変更になる可能性があるため、LTS 後に行われました。それは良いアイデアのように思われましたが、予期せぬ結果をもたらしました。新しいモジュールの導入は後方互換性を維持する方法で行われましたが、前方互換性は維持されませんでした。つまり、3.27 に対してビルドされたエクステンションは 3.27 LTS で動作しますが、3.28 以降のバージョンでは動作しません。3.28 でビルドされたエクステンションは 3.27、および 3.28 以降のバージョンで動作します。

source: This bit of metadata was introduced in Quarkus 3.26.0 and it will be evolving in the upcoming versions.
ja_jp: このメタデータは Quarkus 3.26.0 で導入され、今後のバージョンで進化していく予定です。

source: This block is executed if `machine.status.toString().equals("OFF")` or `machine.status.toString().equals("BROKEN")`.
ja_jp: このブロックは、 `machine.status.toString().equals("OFF")` または `machine.status.toString().equals("BROKEN")` の場合に実行されます

source: This block is executed if `machine.status.toString().equals("ON")`.
ja_jp: このブロックは `machine.status.toString().equals("ON")` の場合に実行されます

source: This blog post announces the 1.0.0.Alpha1 release and future plans.
ja_jp: このブログ投稿では、1.0.0.Alpha1 リリースと今後の計画について発表します。

source: This blog post is the culmination of an idea that Sanne (Grinovero) floated to me during some lunch, back at a time when we, remote engineers, would occasionally meet face to face and have the opportunity to share ideas spontaneously. I'm unsure if the lunch was in Neuchâtel or Barcelona, but essentially Sanne was diagnosing an issue and he struggled with GraalVM's native image analysis call tree text output. He wondered whether that data could instead be formatted differently and imported into a graph database for easier inspection. I'm happy to announce that the GraalVM and Mandrel 21.3.0 releases include improvements to address this particular issue.
ja_jp: このブログ記事は、私たちリモートエンジニアが時々顔を合わせて、自然にアイデアを共有する機会があった頃に、Sanne (Grinovero) がランチの時に浮かんだアイデアの集大成です。そのランチがヌーシャテルだったかバルセロナだったかは定かではありませんが、基本的にSanneはある問題を診断していて、彼はGraalVMのネイティブな画像解析コールツリーのテキスト出力に苦労していました。彼は、そのデータを別のフォーマットにして、グラフデータベースにインポートして簡単に検査できないかと考えていました。GraalVMとMandrel 21.3.0のリリースには、この問題を解決するための改良が含まれていることを発表できて嬉しいです。

source: This blog post uses the https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-orm-quickstart[Quarkus Hibernate ORM quickstart] as a sample Quarkus application. Download the application and execute:
ja_jp: このブログ記事では、 link:https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-orm-quickstart[Quarkus Hibernate ORMクイックスタート]をサンプルQuarkusアプリケーションとして使用しています。アプリケーションをダウンロードして実行してください。

source: This blog post would not have been possible without the expert advice of https://twitter.com/clementplop[Clement Escoffier] and https://twitter.com/unfromage[Stéphane Épardaud].
ja_jp: このブログ記事は、 link:https://twitter.com/clementplop[Clement Escoffier]氏と link:https://twitter.com/unfromage[Stéphane Épardaud]氏の専門的なアドバイスなしには実現できませんでした。

source: This bootstrap process should be the same no matter how Quarkus is launched, just with different parameters passed in.
ja_jp: このブートストラッププロセスは、Quarkus がどのように起動されても、異なるパラメーターが渡されているだけで、同じであるべきです。

source: This bridge OpenTelemetry output name
ja_jp: このブリッジの OpenTelemetry 出力名

source: This bridge OpenTelemetry output name (as seen in the OTLP output)
ja_jp: 本ブリッジの OpenTelemetry 出力名 (OTLP 出力での表示)

source: This bridge methods approach solves a real problem and it's not that big of a deal as it's fully transparent for the developer... except when you start using Mockito due to https://github.com/raphw/byte-buddy/issues/1162[a ByteBuddy issue]: ByteBuddy can get confused if there are several methods with the same signature but different return types.
ja_jp: このブリッジ・メソッドのアプローチは実際の問題を解決するもので、開発者にとっては完全に透過的なので、それほど大きな問題ではありません... link:https://github.com/raphw/byte-buddy/issues/1162[ByteBuddyの問題]でMockitoを使い始める場合を除けば。ByteBuddyは、同じシグネチャで異なる戻り値の型を持つメソッドが複数ある場合、混乱することがあります。

source: This build process is the key to the low memory footprint and fast startup times of Quarkus.
ja_jp: このビルドプロセスが、Quarkusのメモリフットプリントの少なさと起動時間の速さの秘訣です。

source: This build step must be executed after `syntheticBean()` completes.
ja_jp: このビルドステップは、 `syntheticBean()` の完了後に実行する必要があります。

source: This build-time optimization offers several key benefits:
ja_jp: このビルド時最適化は、いくつかの主要な利点をもたらします。

source: This build-time property can be used to register an `OIDC Provider Health Readiness Check` when the `quarkus-smallrye-health` dependency is included. When the health check is registered, it uses HTTP HEAD to ping the well-known OIDC provider configuration endpoint for every configured OIDC tenant.
ja_jp: このビルド時プロパティーは、 `quarkus-smallrye-health` 依存関係が含まれている場合に `OIDC Provider Health Readiness Check` を登録するために使用できます。ヘルスチェックが登録されると、HTTP HEAD を使用して、設定されたすべての OIDC テナントの well-known な OIDC プロバイダー設定エンドポイントに ping を送信します。

source: This build-time property is about controlling if the whole OIDC extension should be enabled. If it is disabled at build-time then the OIDC extension is unavailable at runtime.
ja_jp: このビルド時プロパティーは、OIDC エクステンション全体を有効にするかどうかを制御します。ビルド時に無効に設定された場合、OIDC エクステンションは実行時には利用できません。

source: This builds the application, runs integration tests with AOT training, and generates the `app.aot` cache file in `target/quarkus-app/`.
ja_jp: これにより、アプリケーションがビルドされ、AOT トレーニングを伴う統合テストが実行され、`target/quarkus-app/` に `app.aot` キャッシュファイルが生成されます。

source: This button is simply a convenience to quickly get you started with Flyway, it is up to you to determine how you want to manage your database schemas in production. In particular the `migrate-at-start` setting may not be right for all environments.
ja_jp: このボタンはFlywayを素早く使い始めるためのものであり、本番環境でデータベーススキーマをどのように管理するかはユーザー次第です。特に `migrate-at-start` の設定はすべての環境に適しているとは限りません。
